docs/posts/2016-11-24-gratitude-over-despair.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 28, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Gratitude Over Despair</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Gratitude Over Despair</h1>
<p class="subtitle" role="doc-subtitle">Nov 24, 2016</p>
</header><p>
This prayer is from 2014, but somehow seems fitting again this year:
</p>

<p>
Gracious God,
</p>

<p>
In the events of this year,<br>
we see how fragile our lives truly are.
</p>

<p>
Daily, we are faced with a choice<br>
to be people who live in cynicism and despair,<br>
or people who live in gratitude and thanksgiving.
</p>

<p>
On this day, we choose gratitude over despair,<br>
and lift our hearts in thanksgiving to you,<br>
the one who is the source of all good things.
</p>

<p>
Thank you<br>
for family and friends,<br>
for life and for love,<br>
and for the beauty that we would see<br>
if we would just open our eyes to you.
</p>

<p>
<i>Amen</i>
</p>




<div class="tagline" id="orgf8226a0">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 28, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
